---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.ConfusingSweepByElementsInAnotherDesignOptionWarn
source: html/bac18079-555a-73a5-0710-722c3f6bcd22.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.ConfusingSweepByElementsInAnotherDesignOptionWarn Property

A sweep in a Design Option cannot be hosted by an element in another Design Option [--if you continue it will not be added to the design option set].

## Syntax (C#)
```csharp
public static FailureDefinitionId ConfusingSweepByElementsInAnotherDesignOptionWarn { get; }
```